lvx/base/Catalogs/бит_НастройкиПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиПроизвольныхОтчетов</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособКомпоновки</Name>
					<Comment>Способ компоновки источников данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеМакета</Name>
					<Comment>Хранилище макета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматЧисел</Name>
					<Comment>Формат чисел</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Comment>Язык</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Comment>Тип отчета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыПроизвольныхОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксНомерОбласти</Name>
					<Comment>Максимальный номер области</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс имени области</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаИмени</Name>
					<Comment>Длина имени области без префикса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПериод</Name>
					<Comment>Отображать период</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьОтборПоАналитикеПравилЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Удалить_ПравилаЗаполнения</Name>
					<Comment>Правила заполнения областей отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяОбласти</Name>
							<Comment>Имя области макета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЯчейки</Name>
							<Comment>Вид ячейки</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыЯчеекПроизвольногоОтчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементДанных</Name>
							<Comment>Элемент данных</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРесурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Comment>Формула</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматЧисел</Name>
							<Comment>Формат чисел</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Comment>Параметр</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПараметровПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользованиеАналитики</Name>
					<Comment>Использование аналитики</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Comment>Имя аналитики</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Comment>Аналитика</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинонимАналитики</Name>
							<Comment>Синоним аналитики</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Comment>Имя поля</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Comment>Обязательная</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Enums/бит_ВидыПараметровПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыПараметровПроизвольныхОтчетов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекстНаРазныхЯзыках</Name>
					<Comment>Текст на разных языках</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Enums/бит_ТипыПроизвольныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыПроизвольныхОтчетов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйОтчет</Name>
					<Comment>Произвольный отчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьМСФО</Name>
					<Comment>Отчетность МСФО</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_НастройкиПроизвольныхОтчетов/Forms/ФормаВыбораПараметров/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОтчета              = Параметры.ТипОтчета;
	фИмяПараметраПоследнее = Параметры.ИмяПараметраПоследнее;
	фСпособКомпоновки	   = Параметры.СпособКомпоновки;
		
	ТаблицаПараметров = ЗагрузитьТаблицуПараметров(Параметры.СписокПараметров);

	ОбновитьДеревоПараметров(ТаблицаПараметров);
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	бит_РаботаСДиалогамиКлиент.РазвернутьДеревоПолностью(Элементы.ДеревоПараметров, ДеревоПараметров.ПолучитьЭлементы());
	Элементы.ДеревоПараметров.ТекущаяСтрока = фНомерТекущейСтроки;	
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПараметры

&НаКлиенте
Процедура ДеревоПараметрыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ОбработкаВыбораПараметра();
	
КонецПроцедуры // ДеревоПараметрыВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ОбработкаВыбораПараметра();
	
КонецПроцедуры // ОК()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьТаблицуПараметров(СписокПараметров)

	ТаблицаПараметров = Новый ТаблицаЗначений();
	ТаблицаПараметров.Колонки.Добавить("Параметр");
	ТаблицаПараметров.Колонки.Добавить("ВидПараметра");
	ТаблицаПараметров.Колонки.Добавить("Значение");

	ТЗСпискаПараметров = СписокПараметров.Выгрузить();
	КолонкиСписка      = ТЗСпискаПараметров.СкопироватьКолонки().Колонки;
	КолонкиСписка.Удалить("Параметр");
	Для каждого СтрокаТаблицы Из ТЗСпискаПараметров Цикл
		
		ТекстНаРазныхЯзыках = Новый Структура(); 
		Для каждого Колонка Из КолонкиСписка Цикл
			Если НЕ ПустаяСтрока(СтрокаТаблицы[Колонка.Имя]) Тогда
				ТекстНаРазныхЯзыках.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
			КонецЕсли; 
		КонецЦикла; 
		НоваяСтрока				 = ТаблицаПараметров.Добавить();
		НоваяСтрока.Параметр	 = СтрокаТаблицы.Параметр;
		НоваяСтрока.ВидПараметра = Перечисления.бит_ВидыПараметровПроизвольныхОтчетов.ТекстНаРазныхЯзыках;
		НоваяСтрока.Значение 	 = бит_ОбщегоНазначенияКлиентСервер.СформироватьТекстНаРазныхЯзыках(ТекстНаРазныхЯзыках);

	КонецЦикла; 
	
	Возврат ТаблицаПараметров;
	
КонецФункции // ЗагрузитьТаблицуПараметров()
 
&НаСервере
Функция ДобавитьСтрокуДереваПараметров(СтрокаВерх, ИмяПараметра)

	ВеткаДерева = СтрокаВерх.ПолучитьЭлементы();
	
	СтрокаПараметр = ВеткаДерева.Добавить();
	СтрокаПараметр.ИмяПараметра  = ИмяПараметра;
	СтрокаПараметр.РазрешенВыбор = Истина;
	СтрокаПараметр.Картинка 	 = БиблиотекаКартинок.бит_Реквизит;
	                	
	Если ИмяПараметра = фИмяПараметраПоследнее Тогда 	
		фНомерТекущейСтроки = фСч;	
	КонецЕсли;
	
	фСч = фСч + 1;

	Возврат СтрокаПараметр;
	
КонецФункции // ДобавитьСтрокуДереваПараметров()

// Процедура заполняет дерево параметров.
// 
// Параметры:
//  ТаблицаПараметров - ДанныеФормыКоллекция.
// 
&НаСервере
Процедура ОбновитьДеревоПараметров(ТаблицаПараметров)
	
	КартинкаНеРазрешенВыбор = БиблиотекаКартинок.бит_Реквизиты;
	
	КореньДерева = ДеревоПараметров.ПолучитьЭлементы();
	КореньДерева.Очистить();
	фСч = 0;
	
	// Ветка "Стандартные".
	СтрокаВид = КореньДерева.Добавить();
	СтрокаВид.ИмяПараметра = НСтр("ru = 'Стандартные'");
	СтрокаВид.Картинка 	   = КартинкаНеРазрешенВыбор;
	фСч = фСч + 1;
	
	// Строки ветки "Стандартные".
	Если ТипОтчета = Перечисления.бит_ТипыПроизвольныхОтчетов.ОтчетностьМСФО Тогда
		СтандартныеПараметры = бит_МеханизмПолученияДанных.НовыеСтандартныеПараметрыМСФО();
	Иначе	
		СтандартныеПараметры = бит_МеханизмПолученияДанных.НовыеСтандартныеПараметры();
	КонецЕсли;
	
	Для каждого СтандартныйПараметр Из СтандартныеПараметры Цикл
		ДобавитьСтрокуДереваПараметров(СтрокаВид, СтандартныйПараметр.Ключ);
	КонецЦикла;

	// Ветка "Параметры запросов".
	СтрокаВид = КореньДерева.Добавить();
	СтрокаВид.ИмяПараметра = НСтр("ru = 'Параметры запросов'");
	СтрокаВид.Картинка 	   = КартинкаНеРазрешенВыбор;
	фСч = фСч + 1;
	// Строки ветки "Параметры запросов".
	ПараметрыЗапроса = Новый ТаблицаЗначений(); 
	ПараметрыЗапроса.Колонки.Добавить("ИмяПараметра");
	ПараметрыЗапроса.Колонки.Добавить("ВидПараметра");
	ПараметрыЗапроса.Колонки.Добавить("ЗначениеПараметра");
	ПараметрыЗапроса.Колонки.Добавить("ДоступныеТипы");
	бит_МеханизмПолученияДанных.ОбновитьТаблицуПараметров(фСпособКомпоновки, ПараметрыЗапроса, Истина);
	Для каждого СтрокаТаблицы Из ПараметрыЗапроса Цикл         		
		ДобавитьСтрокуДереваПараметров(СтрокаВид, СтрокаТаблицы.ИмяПараметра);
	КонецЦикла; 

	// Ветка "Отбор"
	СтрокаВид = КореньДерева.Добавить();
	СтрокаВид.ИмяПараметра = НСтр("ru = 'Отбор'");
	СтрокаВид.Картинка 	   = КартинкаНеРазрешенВыбор;
	фСч = фСч + 1;
	// Строки ветки "Отбор"
	ОтборВОтчете = Новый ТаблицаЗначений;
	ОтборВОтчете.Колонки.Добавить("Использование");
	ОтборВОтчете.Колонки.Добавить("Имя");
	ОтборВОтчете.Колонки.Добавить("ВидСравнения");
	ОтборВОтчете.Колонки.Добавить("Значение");    	
	бит_МеханизмПолученияДанных.ЗаполнитьОтборВОтчете(фСпособКомпоновки, ОтборВОтчете);	
	Для каждого СтрокаОтбор Из ОтборВОтчете Цикл         		
		ДобавитьСтрокуДереваПараметров(СтрокаВид, СтрокаОтбор.Имя);
		ДобавитьСтрокуДереваПараметров(СтрокаВид, СтрокаОтбор.Имя + "_ВидСравнения"); 		
	КонецЦикла; 
		
	// Ветка "Текст на разных языках"
	СтрокаВид = КореньДерева.Добавить();
	СтрокаВид.ИмяПараметра = НСтр("ru = 'Текст на разных языках'");
	СтрокаВид.Картинка 	   = КартинкаНеРазрешенВыбор;
	фСч = фСч + 1;
	// Строки ветки "Текст на разных языках".
	Если ТаблицаПараметров <> Неопределено Тогда 		
		Для каждого СтрокаТаблицы Из ТаблицаПараметров Цикл	
			Если СтрокаТаблицы.ВидПараметра = Перечисления.бит_ВидыПараметровПроизвольныхОтчетов.ТекстНаРазныхЯзыках 
				Или Не ЗначениеЗаполнено(СтрокаТаблицы.ВидПараметра) Тогда        			
				ДобавитьСтрокуДереваПараметров(СтрокаВид, СтрокаТаблицы.Параметр);			
			КонецЕсли;   		
		КонецЦикла;
	КонецЕсли;
		   
КонецПроцедуры

// Процедура выполняет действия по кнопке "ОК".
// 
// 
&НаКлиенте
Процедура ОбработкаВыбораПараметра()
	
	ТекущиеДанные = Элементы.ДеревоПараметров.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.РазрешенВыбор  Тогда
		РезСтруктура = Новый Структура;
		РезСтруктура.Вставить("ИмяПараметра", ТекущиеДанные.ИмяПараметра);
		Закрыть(РезСтруктура);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
